In [1]:
import pandas as pd
import numpy as np
import seaborn as sns 
import matplotlib.pyplot as pl

import os 
from dotenv import load_dotenv

In [9]:
df = pd.read_csv('your csv file path')#
df_dict = df.to_dict(orient = 'records') #convert before pushing to MongoDB

In [36]:
DB_NAME = 'us_visa'
COLLECTION_NAME = 'us_visa '
CONNECTION_URL= os.getenv("MONGO_URI") #hide credentials in .env file

In [37]:
#Create a database 
import pymongo
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]
rec = collection.insert_many(df_dict)

In [16]:
df.shape

(25480, 12)

In [29]:
import pymongo
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]

In [38]:
records = collection.find()
records 

#create a cursor to access the db

In [41]:
#make sure everything is working 

from dotenv import load_dotenv
import os
from pymongo import MongoClient

# Load environment variables
load_dotenv()

# Get MongoDB URI
mongo_uri = os.getenv("MONGO_URI")

# Ensure URI is correctly obtained
print(f"Connecting to MongoDB at {mongo_uri}")

try:
    # Connect to MongoDB
    client = MongoClient(mongo_uri)

    # Specify the database and collection
    db = client['us_visa']
    collection = db['us_visa']

    # Try fetching a document
    print("Connected to MongoDB. Collections in the database:")
    print(db.list_collection_names())

except Exception as e:
    print(f"An error occurred: {e}")

Connecting to MongoDB at mongodb+srv://jefferydittenber:jefferydittenber@cluster0.bri4qsn.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0
Connected to MongoDB. Collections in the database:
['us_visa']

In [40]:
print(client.list_database_names())

['sample_mflix', 'us_visa', 'admin', 'local']

In [44]:
#convert database record to pandas dataframe
df = pd.DataFrame(list(collection.find()))

In [45]:
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,65f7438ca03b223909f6f7da,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,65f7438ca03b223909f6f7db,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,65f7438ca03b223909f6f7dc,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,65f7438ca03b223909f6f7dd,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,65f7438ca03b223909f6f7de,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [46]:
if "_id" in df.columns.to_list():
    df = df.drop(columns = ["_id"], axis = 1)


df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

# Begin EDA

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB